# 1)შექმენი ცვლადი სადაც მომხმარებელს შემოატანინებთ რაიმე რიცხვს

# შექმენი მეორე ცვლადი სადაც მომხმარებელს შემოატანინებთ რაიმე სახელს

# შეამოწმე-->

# თუ შემოყვანილი ასაკი მეტოა 60 ზე მაშინ შეამოწმე შიგნით -->
#     თუ შემოყვანილი სახელი არის --> "kote"  მაშინ დაუპრინტე --> შენი სახელია კოტე და ხარ მოხუცი
#     სხვა შემთხვევაში დაუპრინტე --> შენი სახელი არ არის კოტე მაგრამ ხარ მოხუცი

# თუ ასაკი ნაკლებია 60 ზე მაშინ შეამოწმე შიგნით -->
#     თუ შემოყვანილი სახელი --> "kote" მაშინ დაუპრინტე --> შენი სახელი არის კოტე მაგრამ შენ ხარ ახალგაზრდა:
#     სხვა შემთხვევაში დაუპრინტე --> შენი სახელი არ არის კოტე მაგრამ ხალ ახალგაზრდა




num = int(input("enter random num:"))

name = input("enter your name:")


if num > 60:
    if name == "kote":
        print("your name is kote and you are old")
    else:
        print("your name is not kote but you are old")


if num < 60:
    if name == "kote":
        print("your name is kote but you are young")
    else:
        print("your name is not kote but you are young")
