# 8)
# შექმენი ცვლადი და შეინახე შენი პაროლი(string)

# მომხმარებელს შემოატანინე პაროლი

# სანამ შენი პაროლი არ უდრის მომხმარებლის მიერ შემოტანილ პაროლს
#     მომხმარებელს თავიდან შემოატანინე პაროლი რომ გაარტყას შენ პაროლს
# დაპრინტე "სწორია გაარტყი"

# --> გადააკეთეთ ზემოთ მოცემული ტექსტი კოდად(ინდენტაცია დაცულია)


my_password = "saba123"
user_password = input("შეიყვანე პაროლი: ")
while user_password != my_password:
    user_password = input("არასწორია სცადე თავიდან: ")
print("სწორია გაარტყი")
    

        
    
