#  4)შექმენი სია და შეიყვანე სტრიგნები პატარა ასოებით,შენი დავალებაა შეამოწმო,თუ სტრინგი შეიცავს 5 ასოზე მეტს მაშინ ასეთი სიტყვები ჩაამატე ახალ სიაში ოღონდ პირველი ასო ქონდეთ დიდი ,ხოლო თუ სიტყვა შეიცავს 5 ასოზე ნაკლებს მაშინ დაამატე ეს ელემენტებიც სიაში ოღონდ ყველა ასო ქონდეთ დიდი

list = ["manqana" , "televizori" , "compiuteri" ]
list2 = []

for i in range(len(list)):
    if len(list[i]) > 5:
        list2.append(list[i].capitalize())
    else:
        list2.append(list[i].upper())

print(list2)